OS-Q/simba/make/arduino/esp/boards.txt
esp01.name=ESP01

esp01.upload.tool=esptool
esp01.upload.speed=115200
esp01.upload.resetmethod=ck
esp01.upload.maximum_size=434160
esp01.upload.maximum_data_size=81920
esp01.upload.wait_for_upload_port=true
esp01.serial.disableDTR=true
esp01.serial.disableRTS=true

esp01.build.mcu=esp8266
esp01.build.f_cpu=80000000L
esp01.build.board=ESP01
esp01.build.variant=esp01
esp01.build.core=Simba:simba
esp01.build.ldscript=simba.flash.1m.ld
esp01.build.flash_size=512K
esp01.build.flash_mode=dio
esp01.build.flash_freq=40

esp01.compiler.c.extra_flags={esp01_compiler_c_extra_flags}
esp01.compiler.cpp.extra_flags={esp01_compiler_cxx_extra_flags}
esp01.compiler.c.elf.extra_flags={esp01_compiler_c_elf_extra_flags}
esp01.compiler.c.elf.libs={esp01_compiler_c_elf_libs}

##################################################################

esp12e.name=ESP12E

esp12e.upload.tool=esptool
esp12e.upload.speed=115200
esp12e.upload.resetmethod=ck
esp12e.upload.maximum_size=1044464
esp12e.upload.maximum_data_size=81920
esp12e.upload.wait_for_upload_port=true
esp12e.serial.disableDTR=true
esp12e.serial.disableRTS=true

esp12e.build.mcu=esp8266
esp12e.build.f_cpu=80000000L
esp12e.build.board=ESP12E
esp12e.build.variant=esp12e
esp12e.build.core=Simba:simba
esp12e.build.flash_size=4M
esp12e.build.flash_mode=dio
esp12e.build.flash_freq=40

esp12e.compiler.c.extra_flags={esp12e_compiler_c_extra_flags}
esp12e.compiler.cpp.extra_flags={esp12e_compiler_cxx_extra_flags}
esp12e.compiler.c.elf.extra_flags={esp12e_compiler_c_elf_extra_flags}
esp12e.compiler.c.elf.libs={esp12e_compiler_c_elf_libs}

##################################################################

nodemcu.name=NodeMCU

nodemcu.upload.tool=esptool
nodemcu.upload.speed=115200
nodemcu.upload.resetmethod=nodemcu
nodemcu.upload.maximum_size=1044464
nodemcu.upload.maximum_data_size=81920
nodemcu.upload.wait_for_upload_port=true
nodemcu.serial.disableDTR=true
nodemcu.serial.disableRTS=true

nodemcu.build.mcu=esp8266
nodemcu.build.f_cpu=80000000L
nodemcu.build.board=NodeMCU
nodemcu.build.variant=nodemcu
nodemcu.build.core=Simba:simba
nodemcu.build.flash_size=4M
nodemcu.build.flash_mode=qio
nodemcu.build.flash_freq=40

nodemcu.compiler.c.extra_flags={nodemcu_compiler_c_extra_flags}
nodemcu.compiler.cpp.extra_flags={nodemcu_compiler_cxx_extra_flags}
nodemcu.compiler.c.elf.extra_flags={nodemcu_compiler_c_elf_extra_flags}
nodemcu.compiler.c.elf.libs={nodemcu_compiler_c_elf_libs}

##################################################################

huzzah.name=Huzzah

huzzah.upload.tool=esptool
huzzah.upload.speed=115200
huzzah.upload.resetmethod=nodemcu
huzzah.upload.maximum_size=1044464
huzzah.upload.maximum_data_size=81920
huzzah.upload.wait_for_upload_port=true
huzzah.serial.disableDTR=true
huzzah.serial.disableRTS=true

huzzah.build.mcu=esp8266
huzzah.build.f_cpu=80000000L
huzzah.build.board=Huzzah
huzzah.build.variant=huzzah
huzzah.build.core=Simba:simba
huzzah.build.flash_size=4M
huzzah.build.flash_mode=qio
huzzah.build.flash_freq=40

huzzah.compiler.c.extra_flags={huzzah_compiler_c_extra_flags}
huzzah.compiler.cpp.extra_flags={huzzah_compiler_cxx_extra_flags}
huzzah.compiler.c.elf.extra_flags={huzzah_compiler_c_elf_extra_flags}
huzzah.compiler.c.elf.libs={huzzah_compiler_c_elf_libs}

##################################################################
